sources/day_02/advanced_foil/foil_my_mesh/icoFoam/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	inlet
	{
        type            freestreamPressure;
        freestreamValue $internalField;
	}
	
	outlet
	{
		type            freestreamPressure;
        freestreamValue $internalField;
	}
	
	top
	{
		type            symmetryPlane;
	}

	bottom
	{
		type            symmetryPlane;
	}

	foilup
	{
		type            fixedFluxPressure;
		value           uniform 0;
	}

	foillow
	{
		type            fixedFluxPressure;
		value           uniform 0;
	}

	defaultFaces
	{
		type            empty;
	}
}
// ************************************************************************* //
