sources/day_02/advanced_foil/foil_my_mesh/icoFoam/system/foil_sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            surfaces;
libs            ("libsampling.so");

surfaceFormat   raw;
//setFormat       raw;

//interpolationScheme cellPoint;
interpolationScheme cell;

surfaces
(    
    foil
    {
        type         patch;
        patches      ( "foilup" "foillow" );
        interpolate  true;
        // Optional: whether to leave as faces (=default) or triangulate
        triangulate  true;
    }
    
    upper_foil
    {
        type         patch;
        patches      ( "foilup" );
        interpolate  true;
        // Optional: whether to leave as faces (=default) or triangulate
        // triangulate  false;
    }
    
    lower_foil
    {
        type         patch;
        patches      ( "foillow" );
        interpolate  true;
        // Optional: whether to leave as faces (=default) or triangulate
        // triangulate  false;
    }
);

fields          (p);


// ************************************************************************* //
